package net.meyki.skt.utils;

public class BankCardUtil {
	// BIN号
	private final static long[] bankBin = { 601382, 601428,621700, 622166, 622168,
			622200, 622202, 622203, 622208, 622210, 622211,

			622212, 622213, 622214, 622215, 622220, 622225, 622230, 622235,
			622240, 622245,

			622258, 622259, 622260, 622261, 622280, 622384, 622500, 622516,
			622517, 622518,

			622519, 622520, 622521, 622521, 622522, 622522, 622523, 622523,
			622524, 622525,

			622526, 622538, 622575, 622576, 622577, 622578, 622579, 622580,
			622581, 622582,

			622588, 622598, 622600, 622601, 622602, 622603, 622615, 622617,
			622619, 622622,

			622630, 622631, 622632, 622633, 622650, 622655, 622658, 622660,
			622678, 622679,

			622680, 622684, 622688, 622689, 622690, 622691, 622692, 622696,
			622698, 622700,

			622725, 622725, 622728, 622728, 622750, 622751, 622752, 622753,
			622755, 622756,

			622757, 622758, 622759, 622760, 622761, 622762, 622763, 622770,
			622780, 622821,

			622822, 622823, 622824, 622825, 622826, 622827, 622836, 622837,
			622840, 622841,

			622842, 622843, 622844, 622845, 622846, 622847, 622848, 622849,
			622884, 622901,

			622908, 622909, 685800, 685800, 685800, 690755, 843010, 843360,
			843420, 843610,

			843730, 843800, 843850, 843900, 870000, 870100, 870300, 870400,
			870500, };
	// "发卡行.卡种名称",
	private static final String[] bankName = {
		"中国银行","交通银行","中国建设银行","中国建设银行","中国建设银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行",

		"中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行","中国工商银行",

		"交通银行","交通银行","交通银行","交通银行","中国建设银行","恒丰银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行",

		"上海浦东发展银行","交通银行太平洋信用卡","交通银行太平洋信用卡","上海浦东发展银行","交通银行太平洋信用卡","上海浦东发展银行","交通银行太平洋信用卡","上海浦东发展银行","交通银行","深圳发展银行",

		"深圳发展银行","深圳发展银行","招商银行信用卡","招商银行信用卡","招商银行信用卡","招商银行信用卡","招商银行信用卡","招商银行","招商银行信用卡","招商银行",

		"招商银行","招商银行","中国民生银行","中国民生银行","中国民生银行","中国民生银行","中国民生银行","中国民生银行","中国民生银行","中国民生银行",

		"华夏银行","华夏银行","华夏银行","华夏银行","中国光大银行","中国光大银行","中国光大银行","中国光大银行","中信银行信用卡","中信银行信用卡",

		"中信银行信用卡","渤海银行","中信银行信用卡","中信银行信用卡","中信银行","中信银行","中信银行","中信银行","中信银行","中国建设银行",

		"中国建设银行","中国建设银行","中国建设银行","中国建设银行","中国银行","中国银行","中国银行","中国银行","中国银行","中国银行",

		"中国银行","中国银行","中国银行","中国银行","中国银行","中国银行","中国银行","中国银行","中国建设银行","中国农业银行",

		"中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行",

		"中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","中国农业银行","渤海银行","兴业银行",

		"兴业银行","兴业银行","广发银行","广发银行","广发银行","招商银行信用卡","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行",

		"上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行","上海浦东发展银行",

	};

	public static String getNameOfBank(char[] charBin, int offset) {
		long longBin = 0;

		for (int i = 0; i < 6; i++) {
			longBin = (longBin * 10) + (charBin[i + offset] - 48);
		}
		Log.e("sangfei.code", "bankBin: " + longBin);

		int index = binarySearch(bankBin, longBin);

		if (index == -1) {
			return "-1";
		}
		return bankName[index];
	}

	// 二分查找方法
	public static int binarySearch(long[] srcArray, long des) {
		int low = 0;
		int high = srcArray.length - 1;
		while (low <= high) {
			int middle = (low + high) / 2;
			if (des == srcArray[middle]) {
				return middle;
			} else if (des < srcArray[middle]) {
				high = middle - 1;
			} else {
				low = middle + 1;
			}
		}
		return -1;
	}
}
